Tekla Open API Reference for Tekla Structures 2025
AnalysisPartLoadingProperties.LoadGenerationGroupIdentifierFactors Property
 The load generation group identifier factors.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Dictionary<int, double> LoadGenerationGroupIdentifierFactors { get; set; }
Public Property LoadGenerationGroupIdentifierFactors As Dictionary(Of Integer, Double)
	Get
	Set
Property Value
Type: Dictionary<Int32, Double>
See Also
Reference
AnalysisPartLoadingProperties Class
Tekla.Structures.Analysis Namespace